/**
 * @file Definition.h
 * @author Sina Karvandi (sina@rayanfam.com)
 * @brief Header files for global definitions
 * @details This file contains definitions that are use in both user mode and
 * kernel mode Means that if you change the following files, structures or
 * enums, then these settings apply to both usermode and kernel mode
 * @version 0.1
 * @date 2020-04-10
 *
 * @copyright This project is released under the GNU Public License v3.
 *
 */
#pragma once

//////////////////////////////////////////////////
//				Message Tracing                 //
//////////////////////////////////////////////////

/**
 * @brief Default buffer count of packets for message tracing
 * @details number of packets storage
 */
#define MaximumPacketsCapacity 1000

/**
 * @brief Size of each packet
 * @details NOTE : REMEMBER TO CHANGE IT IN USER-MODE APP TOO
 * @warning we redefine it on ScriptEngineCommon.h change it on
 * that file too
 */
#define PacketChunkSize 3000

/**
 * @brief size of user-mode buffer
 * @details Because of Opeation code at the start of the
 * buffer + 1 for null-termminating
 *
 */
#define UsermodeBufferSize sizeof(UINT32) + PacketChunkSize + 1

/**
 * @brief size of buffer for serial
 * @details the maximum packet size for sending over serial
 * User-mode buffer size + Header Structure Size + Count Of End Buffer Bytes
 *
 */
#define MaxSerialPacketSize                               \
    UsermodeBufferSize + sizeof(DEBUGGER_REMOTE_PACKET) + \

 * @brief Maximum Number of Event Handles
 */
#define DEBUGGER_MAXIMUM_SYNCRONIZATION_OBJECTS 0x40

/**
 * @brief An event to show whether the debugger is running
 * or not
 *
 */
#define DEBUGGER_SYNCRONIZATION_OBJECT_IS_DEBUGGER_RUNNING                 0x0
#define DEBUGGER_SYNCRONIZATION_OBJECT_STARTED_PACKET_RECEIVED             0x1
#define DEBUGGER_SYNCRONIZATION_OBJECT_PAUSED_DEBUGGEE_DETAILS             0x2
#define DEBUGGER_SYNCRONIZATION_OBJECT_CORE_SWITCHING_RESULT               0x3
#define DEBUGGER_SYNCRONIZATION_OBJECT_PROCESS_SWITCHING_RESULT            0x4
#define DEBUGGER_SYNCRONIZATION_OBJECT_SCRIPT_RUNNING_RESULT               0x5
#define DEBUGGER_SYNCRONIZATION_OBJECT_SCRIPT_FORMATS_RESULT               0x6
#define DEBUGGER_SYNCRONIZATION_OBJECT_DEBUGGEE_FINISHED_COMMAND_EXECUTION 0x7
#define DEBUGGER_SYNCRONIZATION_OBJECT_FLUSH_RESULT                        0x8
#define DEBUGGER_SYNCRONIZATION_OBJECT_REGISTER_EVENT                      0x9
#define DEBUGGER_SYNCRONIZATION_OBJECT_ADD_ACTION_TO_EVENT                 0xa
#define DEBUGGER_SYNCRONIZATION_OBJECT_MODIFY_AND_QUERY_EVENT              0xb
#define DEBUGGER_SYNCRONIZATION_OBJECT_READ_REGISTERS                      0xc
#define DEBUGGER_SYNCRONIZATION_OBJECT_BP                                  0xd
#define DEBUGGER_SYNCRONIZATION_OBJECT_LIST_OR_MODIFY_BREAKPOINTS          0xe
#define DEBUGGER_SYNCRONIZATION_OBJECT_READ_MEMORY                         0xf
#define DEBUGGER_SYNCRONIZATION_OBJECT_EDIT_MEMORY                         0x10

//////////////////////////////////////////////////
//            End of Buffer Detection           //
//////////////////////////////////////////////////
/**
 * @brief count of characters for serial end of buffer
 */
#define SERIAL_END_OF_BUFFER_CHARS_COUNT 0x4

/**
 * @brief characters of the buffer that we set at the end of
 * buffers for serial
 */
#define SERIAL_END_OF_BUFFER_CHAR_1 0x00
#define SERIAL_END_OF_BUFFER_CHAR_2 0x80
#define SERIAL_END_OF_BUFFER_CHAR_3 0xEE
#define SERIAL_END_OF_BUFFER_CHAR_4 0xFF

//////////////////////////////////////////////////
//              Processor Details               //
//////////////////////////////////////////////////

/**
 * @brief maximum instruction size in intel
 */
#define MAXIMUM_INSTR_SIZE 16

//////////////////////////////////////////////////
//            Callback Definitions              //
//////////////////////////////////////////////////

/**
 * @brief Callback type that can be used to be used
 * as a custom ShowMessages function
 *
 */
typedef int (*Callback)(const char * Text);

//////////////////////////////////////////////////
//               Event Details                  //
//////////////////////////////////////////////////

/**
 * @brief Integer gp registers (this structure is defined in
 * two places, make sure to change it in two places)
 *
 */
#ifndef GUEST_REGS_DEFINED
#    define GUEST_REGS_DEFINED

//
// DO NOT FUCKING TOUCH THIS STRUCTURE WITHOUT COORDINATION WITH SINA
//
typedef struct GUEST_REGS
{
    //
    // DO NOT FUCKING TOUCH THIS STRUCTURE WITHOUT COORDINATION WITH SINA
    //

    ULONG64 rax; // 0x00
    ULONG64 rcx; // 0x08
    ULONG64 rdx; // 0x10
    ULONG64 rbx; // 0x18
    ULONG64 rsp; // 0x20
    ULONG64 rbp; // 0x28
    ULONG64 rsi; // 0x30
    ULONG64 rdi; // 0x38
    ULONG64 r8;  // 0x40
    ULONG64 r9;  // 0x48
    ULONG64 r10; // 0x50
    ULONG64 r11; // 0x58
    ULONG64 r12; // 0x60
    ULONG64 r13; // 0x68
    ULONG64 r14; // 0x70
    ULONG64 r15; // 0x78

    //
    // DO NOT FUCKING TOUCH THIS STRUCTURE WITHOUT COORDINATION WITH SINA
    //

} GUEST_REGS, *PGUEST_REGS;
#endif

/**
 * @brief struct for extra registers
 *
 */
typedef struct GUEST_EXTRA_REGISTERS
{
    USHORT CS;
    USHORT DS;
    USHORT FS;
    USHORT GS;
    USHORT ES;
    USHORT SS;
    UINT64 RFLAGS;
    UINT64 RIP;
} GUEST_EXTRA_REGISTERS, *PGUEST_EXTRA_REGISTERS;

/**
 * @brief RFLAGS in structure format
 *
 */
typedef union _RFLAGS
{
    struct
    {
        UINT64 CarryFlag : 1;
        UINT64 ReadAs1 : 1;
        UINT64 ParityFlag : 1;
        UINT64 Reserved1 : 1;
        UINT64 AuxiliaryCarryFlag : 1;
        UINT64 Reserved2 : 1;
        UINT64 ZeroFlag : 1;
        UINT64 SignFlag : 1;
        UINT64 TrapFlag : 1;
        UINT64 InterruptEnableFlag : 1;
        UINT64 DirectionFlag : 1;
        UINT64 OverflowFlag : 1;
        UINT64 IoPrivilegeLevel : 2;
        UINT64 NestedTaskFlag : 1;
        UINT64 Reserved3 : 1;
